// import {
//   collection,
//   doc,
//   getDoc,
//   getDocs,
//   query,
//   where,
// } from 'firebase/firestore';

// import { db } from '@/firebase/firbaseConfig';
// import { PlayListDataProps } from '@/hooks/usePlaylist';

// // 플레이리스트
// //--------------------create-------------------------------
// // 플리 아이디,플리 제목, 플리 설명, 영상 링크 배열, 해시태그 배열, 공개여부
// //--------------------read---------------------------------
// // 최신순,좋아요순,댓글순
// // 아이디를 받아서 그 아이디가 작성한 플레이리스트 가져오기
// // 해당하는 태그가 포함된 플레이리스트 찾아서 가져오기
// //--------------------update-------------------------------
// // 플리 아이디,플리 제목, 플리 설명, 영상 링크 배열, 해시태그 배열, 공개여부 fetch -> 가져온 데이터 수정 가능
// //--------------------delete-------------------------------
// // 플리 아이디로 찾아 삭제

// //프로필
// //--------------------read---------------------------------
// //아이디를 받아서 프로필 불러오기
// //--------------------update-------------------------------
// //채널이름, 해시태그 fetch -> 두가지만 변경 가능
// //--------------------create-------------------------------
// //--------------------delete-------------------------------
// //해당없음

// //페이지 디테일
